var AutoGlobData = {
    todayIsDownLoadGame: false, // 是否今天下载游戏
    runApp: "1", //  运行APP 1 抖音 2 抖音火山版 3 抖音极速版 4 精养机不看广告 5 其他任务(微信、APP、快手...)
    runModel: '1', //  运行模式 1 养机+看广告 2 精养机+不看广告 3 看广告+不养机 
    miniAppNum: "1", // 观看小程序数量 1 固定数量 2 随机6个 3 随机8个 4 随机全部
    lookRangeNum: [1, 2], // 最少最多观看数量 
    phoneIp: '', //  ip地址
    chaPingNum:'0', //插屏广告数量，如果是5那么就用10/5 没间隔两个看一个插屏 插屏广告数据存本地 看完视频广告后取本地插屏数据更新到最新的广告数据里 
    chaPingModel: '1', //插屏广告模式，看完一个插屏广告等10分钟左右后看视频广告 或者只看插屏广告 所有插屏都看完再看视频广告
    configUrl: '/sdcard/config.ini', // 默认抖音存储空间
    configUrlDy: '/sdcard/config.ini', // 默认抖音存储空间
    configUrlKs: '/sdcard/configKs.ini', // 默认抖音存储空间
    appList: [ // 所有要运行的小程序 固定的，用于初始化数据
        {
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '海豚壁纸库',
            main: '大明网络'
        },
        {
            appName: '云帆壁纸库',
            main: '大明网络'
        },
        {
            appName: '柠檬壁纸库',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        },
        {
            appName: '番茄壁纸库',
            main: '大明网络'
        },
        {
            appName: '熊猫壁纸库',
            main: '大明网络'
        },
        {
            appName: '西瓜壁纸库',
            main: '大明网络'
        },
        {
            appName: '优创汇',
            main: '大明网络'
        },
        {
            appName: '数字大挑战',
            main: '大明网络'
        },
        { 
            appName: '橘子壁纸库', 
            main: '大明网络' 
        },
    ],
    taskApp: [ //  运行的小程序 会变化
        {
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '海豚壁纸库',
            main: '大明网络'
        },
        {
            appName: '云帆壁纸库',
            main: '大明网络'
        },
        {
            appName: '柠檬壁纸库',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        },
        {
            appName: '番茄壁纸库',
            main: '大明网络'
        },
        {
            appName: '熊猫壁纸库',
            main: '大明网络'
        },
        {
            appName: '数字大挑战',
            main: '大明网络'
        },
        {
            appName: '西瓜壁纸库',
            main: '大明网络'
        },
        {
            appName: '优创汇',
            main: '大明网络'
        },
        { appName: '橘子壁纸库', 
            main: '大明网络' 
        },
    ],
    phoneIdToNameList: {
        "071882201":'vivoX23-坏屏幕',
        "531011851":'荣耀30',
        "131391382":'荣耀20',
        "371752232":'vivoX23-好屏幕',
        "692411262":'Mate20',
        "351912422":"Mate20Pro",
        "491061091":'新买的mate20Pro',
        "042301751":'nove5Pro',
        "811147186":'荣耀V20',
    },
    phoneId: device.getDeviceIntID(),
    adListApiData: [], // 接口获取的小程序列表
    adBiaoZhun1: 2 * 60 * 60 * 1000, // 同手机同小程序观看时间要大于2小时+一个随机数（小于10分钟的）
    adBiaoZhun2: 30 * 60 * 1000, // 同手机不同小程序观看时间要大于40分钟+一个随机数（小于10分钟的）
    adBiaoZhun3: 10 * 60 * 1000, // 不同手机同小程序观看时间要大于10分钟+一个随机数（小于5分钟的）
    adBiaoZhun4: 5 * 60 * 1000, // 不同手机不同小程序观看时间要大于5分钟+一个随机数（小于1分钟的）
    todayTaskAllList: [], // 随机今天广告观看次数数组
    yangjiNum: 0,
    waitNumList: {
        list: []
    },
    todayTimeInterval: {
        time: time.nowStamp(),
        // dataArr: [10,45,15,30,5,60,0,25,5,40,15]
        dataArr: [10,5,15,30,5,20,0,25,5,40,15]
    },
    appPhoneName: '抖音',
    adMaxNum: 2,
    adMiniNum: 1,
    isClick: false,
    taskdetail: {},
    phoneLookTotal: {
        total: 0,
        downLoadTotal: 0
    },
    // 选装 '百度地图', '美团','快手极速版',
    yuzhuangAPP: ['京东', '支付宝', '微信'], //牛马传奇 热血江湖等
    //启动预装APP  可以的话自动预先登录下载和玩转化的游戏。每天要有登录的数据。这样就能形成闭环。增加手机的权重和价值。
    IP: "",
    intervalTimeArr: [1, 1.2], // 预启动等待间隔
    //先手动去养养  植发 种牙 近视眼  
    // "比亚迪推荐", "宝马推荐", "路虎推荐", "奔驰推荐", "新能源汽车推荐","最新款长安","零跑汽车推荐",'理想汽车推荐','理想汽车推荐','岚图汽车推荐','智己汽车推荐'
    // 要注意下载和玩转化的游戏。每天要有登录的数据。这样就能形成闭环。增加手机的权重和价值。
    // 酒水加盟，加盟项目推荐，仙侠游戏排名 高端家电推荐
    // 最新精准关键词 广大美美肤中心 中幸口腔  丝缘植发 丽合疤痕修复 天津伊美尔医疗整形医院

    // ------------------------------------------------------------------------出现过的广告标签--------------------------------------------------------------   
    
    // 抖音的游戏库广告非常多 更不不用担心一个广告一直出现
    // 游戏类： 万龙觉醒  万国觉醒  英雄杀 三国志战略版 三国谋定天下  王者征途 梦幻西游 诛仙  率土之滨 永远的蔚蓝星球手游  潮汐守望者手游 三国*冰河时代 SLG手游推荐
    //         武林外传*十年之约  热血江湖  原始征途  烈焰觉醒  无尽冬日  偃武   乌木六届传奇  185复古版传奇  攻城略地手游 仙遇手游 青云诀2 辣条遮天沉默 
    //         大武林手游  帝国战纪  捕鱼大作战 千年高爆版  魂之眼忍者激战 骷髅传奇

    //电话类：  丝缘植发  新航道国际学校 中幸种牙 中牙口腔医院 广大美肤 华为汽车推荐  问界M7 奥迪汽车 
    //                  腾势汽车 比亚迪汽车  零跑汽车  林肯汽车  智能选股 岚图汽车  整形医院 酒水加盟  

    // -----------------------------------------------------------------------------------------------------------------------------------------------------

    // 各个标签每周换一次
    searchObjData:
    {   
        "传奇": [ //1天
            // -----------*******标签1*******--------
            '传奇手游最新推荐',
            '仙侠手游推荐',
            "塔防手游推荐",
            "塔防手游排行榜第一",
            "最新的新能源汽车推荐",
            "名扬传奇手游推荐",
            "复古版传奇手游",
            // -----------*******标签1*******--------

            // -----------*******标签2*******--------
            // "种牙推荐",
            // "三国手游推荐",
            // '原始征途手游',
            // "岚图汽车推荐",
            // "植发推荐",
            // "聊天交友手游推荐",
            // "有什么好玩的传奇手游",
            // -----------*******标签2*******--------

            // "名扬传奇手游推荐",
            // "广汽本田汽车推荐",
            // "复古版传奇手游",
            // "原始传奇手游",
            // "单职业传奇手游推荐",
            // "爆率超高的传奇手游",
            // "无限刀速传奇手游",
            // "精品传奇手游",
            // "沉默传奇手游",
        ],
        "传奇1": [ //1天
            // -----------*******标签1*******--------
            '传奇手游高爆版',
            "复古176版传奇手游",
            '仙侠手游推荐',
            "最新款长安",
            "180版本传奇手游",
            '复古版传奇手游',
            "名扬传奇手游推荐",
            '策略手游推荐',
            // -----------*******标签1*******--------

            // -----------*******标签2*******--------
            // "新能源汽车推荐",
            // '今年最火的加盟项目',
            // "婚宴推荐",
            // "去疤痕推荐用什么",
            // '传奇996',
            // '三国志战略版',
            // "三国谋定天下",
            // -----------*******标签2*******--------

            // "出国留学教育推荐",
            // "去疤痕推荐用什么",
            // "仙侠手游推荐",
            // "传奇怀旧版",
            // "180合击版本传奇手游",
            // "复古176版传奇手游",
            // '传奇996',
            // "原始征途手游",
            // "无限刀速传奇手游",
            // "单职业传奇手游推荐",
        ],
        "其他": [ //1天
            // -----------*******标签1*******--------
            "180合击版本传奇手游",
            "植发推荐",
            "单职业传奇手游推荐",
            "口腔医院推荐",
            "名扬传奇手游推荐",
            "广汽本田汽车推荐",
            "华为汽车推荐",
            "出国留学教育推荐",
            // -----------*******标签1*******--------

            // -----------*******标签2*******--------
            // "广大美美肤中心",
            // "出国留学教育推荐",
            // "交友手游推荐",
            // "口腔医院推荐",
            // '雍禾植发',
            // "去疤痕推荐用什么",
            // "出国留学教育推荐",
            // -----------*******标签2*******--------


            // "婚宴推荐",
             // '理想汽车推荐',
            // "近视眼怎么治",
            // "雍禾植发",
            // "种牙哪家好",
            // "口腔医院推荐",
        ],
        "其他1": [ //1天
            // -----------*******标签1*******--------
            '传奇手游高爆版',
            "单职业传奇手游推荐",
            '好玩的仙侠手游推荐',
            "最新款华为汽车推荐",
            "爆率超高的传奇手游",
            "雍禾植发",
            "极氪汽车推荐",
            // -----------*******标签1*******--------

            // -----------*******标签2*******--------
            // "中幸种牙怎么样",
            // "种牙医院",
            // '今年最火的加盟项目',
            // "去疤痕推荐",
            // "天津新航道学校",
            // "单职业传奇手游推荐",
            // -----------*******标签2*******--------

        ],
        "汽车": [ //1天
            // -----------*******标签1*******--------
            '复古版传奇手游',
            "长安汽车推荐",
            '传奇手游高爆版',
            "华为问界汽车推荐",
            "植发推荐",
            "极氪汽车推荐",
            '策略手游推荐',
            "长安汽车推荐",
            "单职业传奇手游推荐",
            "华为汽车推荐",
            "路虎汽车推荐",
            "国产新能源汽车推荐",
            // -----------*******标签1*******--------

            // -----------*******标签2*******--------
            // "最新款豪华汽车推荐",
            // "最新款华为汽车推荐",
            // "岚图汽车怎么样",
            // "小鹏汽车推荐",
            // "比亚迪汽车推荐",
            // "理想汽车推荐",
            // "最新款的比亚迪新能源汽车",
            // -----------*******标签2*******--------
            
           
        ]
        
    },
    searchObjData2:
    {   
        "传奇": [ 
            // -----------*******标签2*******--------
            "种牙推荐",
            "三国手游推荐",
            '原始征途手游',
            "岚图汽车推荐",
            "植发推荐",
            "聊天交友手游推荐",
            // "有什么好玩的传奇手游",
            // -----------*******标签2*******--------
        ],
        "传奇1": [ //1天
            // -----------*******标签2*******--------
            "新能源汽车推荐",
            '今年最火的加盟项目',
            "婚宴推荐",
            "去疤痕推荐用什么",
            '传奇996',
            '三国志战略版',
            "三国谋定天下",
            // -----------*******标签2*******--------
        ],
        "其他": [ 
            // -----------*******标签2*******--------
            "广大美美肤中心",
            "出国留学教育推荐",
            "交友手游推荐",
            "口腔医院推荐",
            '雍禾植发',
            "去疤痕推荐用什么",
            "出国留学教育推荐",
        ],
        "其他1": [
            // -----------*******标签2*******--------
            "中幸种牙怎么样",
            "种牙医院",
            '今年最火的加盟项目',
            "去疤痕推荐",
            "天津新航道学校",
            "单职业传奇手游推荐",
            // -----------*******标签2*******--------

        ],
        "汽车": [ 
            // -----------*******标签2*******--------
            "最新款豪华汽车推荐",
            "最新款华为汽车推荐",
            "岚图汽车怎么样",
            "小鹏汽车推荐",
            "比亚迪汽车推荐",
            "理想汽车推荐",
            "最新款的比亚迪新能源汽车"
            // -----------*******标签2*******--------
        ]
        
    },
    searchObjData1:
    {   
        "传奇": [ 
            // -----------*******标签3*******--------
            '好玩的传奇手游推荐',
            '原始征途手游',
            "王者征途手游",
            "武林外传手游",
            "传奇手游推荐",
            "塔防手游推荐",
            // "有什么好玩的传奇手游",
            // -----------*******标签3*******--------
        ],
        "传奇1": [ //1天
            // -----------*******标签3*******--------
            "三国谋定天下",
            "塔防手游推荐",
            '三国志战略版',
            "三国杀手游好玩吗",
            "三国类手游推荐",
            '三国卡牌类手游推荐',
            // -----------*******标签3*******--------
        ],
        "其他": [ 
            // -----------*******标签3*******--------
            "中幸种牙怎么样",
            "中牙口腔",
            "丝缘植发",
            "天津口腔医院推荐",
            '雍禾植发',
            "天津植发医院推荐",
            "出国留学教育推荐",
        ],
        "其他1": [
            // -----------*******标签3*******--------
            "热血江湖手游",
            "寻道大千手游",
            '诛仙手游',
            "梦幻西游手游",
            "好玩的仙侠手游推荐",
            "仙侠手游哪个好玩",
            // -----------*******标签3*******--------

        ],
        "汽车": [ 
            // -----------*******标签3*******--------
            "奔驰汽车推荐",
            "最新款华为汽车推荐",
            "零跑汽车推荐",
            "小鹏汽车推荐",
            "比亚迪汽车推荐",
            "智己汽车推荐",
            "最新款的比亚迪新能源汽车"
            // -----------*******标签3*******--------
        ]
        
    },
    searchArr: [],
    initSearchNum() {
        // 设置关键词搜索的顺序和天数
        let searArrTextObj = {
            '传奇': 1,
            '传奇1': 1,
            '其他': 1,
            '其他1': 1,
            '汽车': 1,
            // '三国': 1,
            // '仙侠': 1,
        }
        for(let key in searArrTextObj) {
            for(let i=0;i<searArrTextObj[key];i++){
                this.searchArr.push({time: Number(time.nowStamp()) + i*24*60*60*1000,textArr:this.searchObjData[key]})
            }
        }
    }
}
AutoGlobData.initSearchNum()

