var AutoGlobData = {
    runApp: "1", //  运行APP 1 抖音 2 抖音火山版 3 抖音极速版 4 精养机不看广告 5 其他任务(微信、APP、快手...)
    runModel: '1', //  运行模式 1 养机+看广告 2 精养机+不看广告 3 看广告+不养机 
    miniAppNum: "1", // 观看小程序数量 1 固定数量 2 随机6个 3 随机8个 4 随机全部
    lookRangeNum: [1, 2], // 最少最多观看数量 
    phoneIp: '', //  ip地址
    configUrl: '/sdcard/config.ini', // 默认抖音存储空间
    configUrlDy: '/sdcard/config.ini', // 默认抖音存储空间
    configUrlKs: '/sdcard/configKs.ini', // 默认抖音存储空间
    appList: [ // 所有要运行的小程序 固定的，用于初始化数据
        {
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '海豚壁纸库',
            main: '大明网络'
        },
        {
            appName: '云帆壁纸库',
            main: '大明网络'
        },
        {
            appName: '柠檬壁纸库',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        },
        {
            appName: '番茄壁纸库',
            main: '大明网络'
        },
        {
            appName: '熊猫壁纸库',
            main: '大明网络'
        },
        {
            appName: '西瓜壁纸库',
            main: '大明网络'
        },
        {
            appName: '优创汇',
            main: '大明网络'
        },
        {
            appName: '数字大挑战',
            main: '大明网络'
        },
        { 
            appName: '橘子壁纸库', 
            main: '大明网络' 
        },
    ],
    taskApp: [ //  运行的小程序 会变化
        {
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '海豚壁纸库',
            main: '大明网络'
        },
        {
            appName: '云帆壁纸库',
            main: '大明网络'
        },
        {
            appName: '柠檬壁纸库',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        },
        {
            appName: '番茄壁纸库',
            main: '大明网络'
        },
        {
            appName: '熊猫壁纸库',
            main: '大明网络'
        },
        {
            appName: '数字大挑战',
            main: '大明网络'
        },
        {
            appName: '西瓜壁纸库',
            main: '大明网络'
        },
        {
            appName: '优创汇',
            main: '大明网络'
        },
        { appName: '橘子壁纸库', 
            main: '大明网络' 
        },
    ],
    phoneIdToNameList: {
        "071882201":'vivoX23-坏屏幕',
        "531011851":'荣耀30',
        "131391382":'荣耀20',
        "371752232":'vivoX23-好屏幕',
        "692411262":'Mate20',
        "351912422":"Mate20Pro",
        "491061091":'新买的mate20Pro',
        "042301751":'nove5Pro',
        "811147186":'荣耀V20',
    },
    phoneId: device.getDeviceIntID(),
    adListApiData: [], // 接口获取的小程序列表
    adBiaoZhun1: 2 * 60 * 60 * 1000, // 同手机同小程序观看时间要大于2小时+一个随机数（小于10分钟的）
    adBiaoZhun2: 50 * 60 * 1000, // 同手机不同小程序观看时间要大于40分钟+一个随机数（小于10分钟的）
    adBiaoZhun3: 10 * 60 * 1000, // 不同手机同小程序观看时间要大于10分钟+一个随机数（小于5分钟的）
    adBiaoZhun4: 5 * 60 * 1000, // 不同手机不同小程序观看时间要大于5分钟+一个随机数（小于1分钟的）
    todayTaskAllList: [], // 随机今天广告观看次数数组
    yangjiNum: 0,
    waitNumList: {
        list: []
    },
    appPhoneName: '抖音',
    adMaxNum: 2,
    adMiniNum: 1,
    isClick: false,
    taskdetail: {},
    phoneLookTotal: {
        total: 0,
        downLoadTotal: 0
    },
    // 选装 '百度地图', '美团','快手极速版',
    yuzhuangAPP: ['京东', '支付宝', '微信'], //牛马传奇 热血江湖等
    //启动预装APP  可以的话自动预先登录下载和玩转化的游戏。每天要有登录的数据。这样就能形成闭环。增加手机的权重和价值。
    IP: "",
    intervalTimeArr: [1, 1.2], // 预启动等待间隔
    phoneListRunAppObj: {
        // 荣耀30
        "531011851": [{
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '海豚壁纸库',
            main: '大明网络'
        },
        {
            appName: '云帆壁纸库',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        },
        {
            appName: '熊猫壁纸库',
            main: '大明网络'
        },
        ],
        // Mate20
        "692411262": [{
            appName: '西瓜壁纸库',
            main: '大明网络'
        },
        {
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '番茄壁纸库',
            main: '大明网络'
        },
        {
            appName: '柠檬壁纸库',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        },
        ],
        // Mate20Pro
        "351912422": [{
            appName: '洛雪壁纸',
            main: '大明网络'
        },
        {
            appName: '海豚壁纸库',
            main: '大明网络'
        },
        {
            appName: '云帆壁纸库',
            main: '大明网络'
        },
        {
            appName: '西瓜壁纸库',
            main: '大明网络'
        },
        {
            appName: '优创汇',
            main: '大明网络'
        },
        {
            appName: '橙子壁纸库',
            main: '大明网络'
        }
        ]
    },
    //先手动去养养  植发 种牙 近视眼  
    // "比亚迪推荐", "宝马推荐", "路虎推荐", "奔驰推荐", "新能源汽车推荐","最新款长安","零跑汽车推荐",'理想汽车推荐','理想汽车推荐','岚图汽车推荐','智己汽车推荐'
    // 要注意下载和玩转化的游戏。每天要有登录的数据。这样就能形成闭环。增加手机的权重和价值。
    // 酒水加盟，加盟项目推荐，仙侠游戏排名 高端家电推荐
    // 最新精准关键词 广大美美肤中心 中幸口腔  丝缘植发 丽合疤痕修复 天津伊美尔医疗整形医院
    searchObjData:
    {   
        "传奇": [ //1天
            '传奇手游最新推荐',
            '仙侠手游推荐',
            "最新的新能源汽车推荐",
            "名扬传奇手游推荐",
            "复古版传奇手游",
            "种牙推荐",
            "仙侠手游推荐",
            '传奇手游高爆版',
            "单职业传奇手游推荐",
            // "植发推荐",
            // "有什么好玩的传奇手游",
            
            // "名扬传奇手游推荐",
            // "广汽本田汽车推荐",
            // "复古版传奇手游",
            // "原始传奇手游",
            // "单职业传奇手游推荐",
            // "爆率超高的传奇手游",
            // "无限刀速传奇手游",
            // "精品传奇手游",
            // "沉默传奇手游",
        ],
        "传奇1": [ //1天
            '复古版传奇手游',
            '仙侠手游推荐',
            // "去疤痕推荐用什么",
            '策略手游推荐',
            "新能源汽车推荐",
            '传奇手游高爆版',
            '今年最火的加盟项目',
            // "婚宴推荐",
            // "去疤痕推荐",
            "仙侠手游推荐",
            // '传奇996',
            // '三国志战略版',
            // "三国谋定天下",
            // "出国留学教育推荐",
            // "去疤痕推荐用什么",
            // "仙侠手游推荐",
            // "传奇怀旧版",
            // "180合击版本传奇手游",
            // "复古176版传奇手游",
            // '传奇996',
            // "原始征途手游",
            // "无限刀速传奇手游",
            // "单职业传奇手游推荐",
        ],
        "其他": [ //1天
            "出国留学教育推荐",
            "名扬传奇手游推荐",
            "植发推荐",
             "口腔医院推荐",
            // '理想汽车推荐',
            "植发医院",
            '今年最火的加盟项目',
            // "婚宴推荐",
            "种牙推荐",
            // "去疤痕推荐用什么",
            // "出国留学教育推荐",
            '策略手游推荐',
            // "近视眼怎么治",
            // "雍禾植发",
            // "种牙哪家好",
            // "口腔医院推荐",
        ],
        "其他1": [ //1天
            '传奇手游高爆版',
            "中幸种牙怎么样",
            "种牙医院",
            '今年最火的加盟项目',
            "最新款华为汽车推荐",
            "雍禾植发",
            // "去疤痕推荐",
            "出国留学教育推荐",
            // "天津新航道学校",
        ],
        "汽车": [ //1天
            '复古版传奇手游',
            "长安汽车推荐",
            // "最新款豪华汽车推荐",
            // "最新款华为汽车推荐",
            '传奇手游高爆版',
            "植发推荐",
            "极氪汽车推荐",
            '策略手游推荐',
            "长安汽车推荐",
            "单职业传奇手游推荐",
            "华为汽车推荐",
            "路虎汽车推荐",
            // '保时捷中国'
            // "岚图汽车怎么样",
            // "小鹏汽车推荐",
            // "比亚迪汽车推荐",
            // "理想汽车推荐",
            // "最新款的比亚迪新能源汽车",
            "国产新能源汽车推荐",
        ],
        // "三国": [ //一天
        //     "三国手游推荐",
        //     "三国杀手游",
        //     "slg手游最新推荐",
        //     "三国版策略手游",
        //     '三国谋定天下手游',
        //     "回和制手游",
        //     "单职业传奇手游",
        // ],
        // "仙侠": [ //一天
        //     "仙侠手游推荐",
        //     "诛仙手游",
        //     "梦幻西游手游",
        //     "精品仙侠手游",
        //     "热血江湖手游",
        //     "问道手游",
        // ],
        
    },
    searchArr: [],
    initSearchNum() {
        // 设置关键词搜索的顺序和天数
        let searArrTextObj = {
            '传奇': 1,
            '传奇1': 1,
            '其他': 1,
            '其他1': 1,
            '汽车': 1,
            // '三国': 1,
            // '仙侠': 1,
        }
        for(let key in searArrTextObj) {
            for(let i=0;i<searArrTextObj[key];i++){
                this.searchArr.push({time: Number(time.nowStamp()) + i*24*60*60*1000,textArr:this.searchObjData[key]})
            }
        }
    }
}
AutoGlobData.initSearchNum()

